# GetConnectedProperty Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetProperty..::..GetConnectedProperty Method
AssetProperty Class See Also
---
Gets one connected property with specified index.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public AssetProperty GetConnectedProperty(
	int index
)
```

Visual Basic
---
```text
Public Function GetConnectedProperty ( _
	index As Integer _
) As AssetProperty
```

Visual C++
---
```text
public:
AssetProperty^ GetConnectedProperty(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32
# ### Return Value
The AProperty of that index.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | index is out of range. |

# See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace